; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v12 ?v11)
             (pred_1 ?v2 ?v9)
             (pred_8 ?v12 ?v9)
             (pred_11 ?v6 ?v12 )
	     (pred_12 ?v12)
             (pred_6 ?v10)
             (pred_4 ?v2)
             (pred_10 ?v9)
             (pred_2 ?v12)
             (pred_3 ?v2)
             (pred_9 ?v12)
             (pred_7 ))



(:action op_3
:parameters (?v1 ?v13 ?v5 ?v3)
:precondition (and (pred_6 ?v1) (pred_6 ?v13) (pred_4 ?v5) (pred_10 ?v3)
          (pred_5 ?v1 ?v13) (pred_1 ?v5 ?v3)
                   (pred_8 ?v13 ?v3) (pred_12 ?v1) 
                   (pred_2 ?v13) (pred_3 ?v5))
:effect (and  (pred_9 ?v13) (not (pred_2 ?v13))))


(:action op_4
:parameters (?v1 ?v8)
:precondition (and (pred_6 ?v1) (pred_6 ?v8)
               (pred_12 ?v1) (pred_5 ?v1 ?v8) (pred_9 ?v8))
:effect (and (pred_12 ?v8) (not (pred_12 ?v1))))

(:action op_5
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_4 ?v5) 
                  (pred_12 ?v1) (pred_11 ?v5 ?v1) (pred_7 ))
:effect (and (pred_3 ?v5)
   (not (pred_11 ?v5 ?v1)) (not (pred_7 ))))


(:action op_1
:parameters (?v1 ?v7 ?v4)
:precondition (and (pred_6 ?v1) (pred_4 ?v7) (pred_4 ?v4)
                  (pred_12 ?v1) (pred_3 ?v4) (pred_11 ?v7 ?v1))
:effect (and (pred_3 ?v7) (pred_11 ?v4 ?v1)
        (not (pred_3 ?v4)) (not (pred_11 ?v7 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_4 ?v5) 
                  (pred_12 ?v1) (pred_3 ?v5))
:effect (and (pred_7 ) (pred_11 ?v5 ?v1) (not (pred_3 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_10 obj_17 obj_05 obj_09 obj_04 obj_07 obj_13 obj_14 obj_02 obj_01 obj_11 obj_21 obj_16 obj_15 obj_19
    obj_03 obj_18
    obj_20 obj_12 obj_08
    )

    (:init
       (pred_7)

       (pred_6 obj_06)
       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_01)
       (pred_6 obj_11)
       (pred_6 obj_21)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_4 obj_20)
       (pred_4 obj_12)
       (pred_4 obj_08)

       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_15 obj_19)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_8  obj_11 obj_03)
       (pred_8  obj_01 obj_18)
       (pred_8  obj_16 obj_18)
       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_09)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_14)
       (pred_9 obj_02)
       (pred_9 obj_21)
       (pred_9 obj_15)
       (pred_9 obj_19)

       (pred_1  obj_20 obj_03)
       (pred_1  obj_12 obj_18)
       (pred_1  obj_08 obj_18)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_08 obj_17)
       (pred_12 obj_13)
    )

    (:goal (and
       (pred_11 obj_12 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_07)))
)
)

; plan
1. (op_4 obj_13 obj_05)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_05)
   goals met: 0 of 1
2. (op_4 obj_05 obj_17)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_17)
   goals met: 0 of 1
3. (op_4 obj_17 obj_10)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_10)
   goals met: 0 of 1
4. (op_4 obj_10 obj_04)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_12)
   deleted: (pred_11 obj_12 obj_04) (pred_7)
   added: (pred_3 obj_12)
   goals met: 0 of 1
6. (op_4 obj_04 obj_10)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_10)
   goals met: 0 of 1
7. (op_4 obj_10 obj_17)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_17)
   goals met: 0 of 1
8. (op_4 obj_17 obj_05)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_05)
   goals met: 0 of 1
9. (op_2 obj_05 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_7) (pred_11 obj_12 obj_05)
   goals met: 1 of 1
